Revit 2024 API
IIFCEntityTreeUIServer Interface
 The interface used to provide UI on IFC Entity selection.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public interface IIFCEntityTreeUIServer : IExternalServer
Visual Basic
Public Interface IIFCEntityTreeUIServer _
	Inherits IExternalServer
Visual C++
public interface class IIFCEntityTreeUIServer : IExternalServer
See Also
IIFCEntityTreeUIServer Members
Autodesk.Revit.UI Namespace